from aiogram import Router, F
from aiogram.types import Message
from config import menu_btn
motivations = [
    "🔥 Не жди — начни сегодня! Даже маленький шаг лучше, чем стояние на месте.",
    "💪 Каждый повтор приближает тебя к лучшей версии себя.",
    "🏋️‍♂️ Сила не в теле, а в духе. Поднимай не только штангу, но и себя.",
    "⚡ Боль — временная. Результат — навсегда.",
    "🚀 Не сравнивай себя с другими, сравни себя с тем, кем ты был вчера.",
    "🦾 Успех — это 1% таланта и 99% пота.",
    "🔥 Сегодня тяжело, завтра — красиво.",
    "💥 Если тебе тяжело, значит, ты идёшь в правильном направлении.",
    "🏆 Настоящий прогресс начинается, когда ты не сдаёшься.",
    "⚔️ Тренируйся, будто завтра — твой бой!"
]
user_motivation_index = {}

motivation = Router()
@motivation.message(F.text=='🔥Мотивация')
async def send_motivation(message:Message):
    user_id = message.from_user.id
    index = user_motivation_index.get(user_id, 0)
    await message.answer(motivations[index],reply_markup=menu_btn)
    next_index = (index + 1) % len(motivations)
    user_motivation_index[user_id] = next_index

